In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
from sklearn.linear_model import LinearRegression

In [2]:
df1 = pd.read_csv("ds_salaries.csv")
df2 = pd.read_csv("jobs_in_data.csv")

df1

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2023,SE,FT,Principal Data Scientist,80000,EUR,85847,ES,100,ES,L
1,2023,MI,CT,ML Engineer,30000,USD,30000,US,100,US,S
2,2023,MI,CT,ML Engineer,25500,USD,25500,US,100,US,S
3,2023,SE,FT,Data Scientist,175000,USD,175000,CA,100,CA,M
4,2023,SE,FT,Data Scientist,120000,USD,120000,CA,100,CA,M
...,...,...,...,...,...,...,...,...,...,...,...
3750,2020,SE,FT,Data Scientist,412000,USD,412000,US,100,US,L
3751,2021,MI,FT,Principal Data Scientist,151000,USD,151000,US,100,US,L
3752,2020,EN,FT,Data Scientist,105000,USD,105000,US,100,US,S
3753,2020,EN,CT,Business Data Analyst,100000,USD,100000,US,100,US,L
3754,2021,SE,FT,Data Science Manager,7000000,INR,94665,IN,50,IN,L

In [3]:
df2

,work_year,job_title,job_category,salary_currency,salary,salary_in_usd,employee_residence,experience_level,employment_type,work_setting,company_location,company_size
0,2023,Data DevOps Engineer,Data Engineering,EUR,88000,95012,Germany,Mid-level,Full-time,Hybrid,Germany,L
1,2023,Data Architect,Data Architecture and Modeling,USD,186000,186000,United States,Senior,Full-time,In-person,United States,M
2,2023,Data Architect,Data Architecture and Modeling,USD,81800,81800,United States,Senior,Full-time,In-person,United States,M
3,2023,Data Scientist,Data Science and Research,USD,212000,212000,United States,Senior,Full-time,In-person,United States,M
4,2023,Data Scientist,Data Science and Research,USD,93300,93300,United States,Senior,Full-time,In-person,United States,M
...,...,...,...,...,...,...,...,...,...,...,...,...
9350,2021,Data Specialist,Data Management and Strategy,USD,165000,165000,United States,Senior,Full-time,Remote,United States,L
9351,2020,Data Scientist,Data Science and Research,USD,412000,412000,United States,Senior,Full-time,Remote,United States,L
9352,2021,Principal Data Scientist,Data Science and Research,USD,151000,151000,United States,Mid-level,Full-time,Remote,United States,L
9353,2020,Data Scientist,Data Science and Research,USD,105000,105000,United States,Entry-level,Full-time,Remote,United States,S
9354,2020,Business Data Analyst,Data Analysis,USD,100000,100000,United States,Entry-level,Contract,Remote,United States,L

In [4]:
df1.shape

(3755, 11)

In [5]:
df2.shape

(9355, 12)

In [6]:
df1.isnull().sum()

work_year             0
experience_level      0
employment_type       0
job_title             0
salary                0
salary_currency       0
salary_in_usd         0
employee_residence    0
remote_ratio          0
company_location      0
company_size          0
dtype: int64

In [7]:
df2.isnull().sum()

work_year             0
job_title             0
job_category          0
salary_currency       0
salary                0
salary_in_usd         0
employee_residence    0
experience_level      0
employment_type       0
work_setting          0
company_location      0
company_size          0
dtype: int64

In [8]:
#df1.drop_duplicates(inplace=True)

In [9]:
df2.drop_duplicates(inplace=True)

In [10]:
df1

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2023,SE,FT,Principal Data Scientist,80000,EUR,85847,ES,100,ES,L
1,2023,MI,CT,ML Engineer,30000,USD,30000,US,100,US,S
2,2023,MI,CT,ML Engineer,25500,USD,25500,US,100,US,S
3,2023,SE,FT,Data Scientist,175000,USD,175000,CA,100,CA,M
4,2023,SE,FT,Data Scientist,120000,USD,120000,CA,100,CA,M
...,...,...,...,...,...,...,...,...,...,...,...
3750,2020,SE,FT,Data Scientist,412000,USD,412000,US,100,US,L
3751,2021,MI,FT,Principal Data Scientist,151000,USD,151000,US,100,US,L
3752,2020,EN,FT,Data Scientist,105000,USD,105000,US,100,US,S
3753,2020,EN,CT,Business Data Analyst,100000,USD,100000,US,100,US,L
3754,2021,SE,FT,Data Science Manager,7000000,INR,94665,IN,50,IN,L

In [11]:
df2

,work_year,job_title,job_category,salary_currency,salary,salary_in_usd,employee_residence,experience_level,employment_type,work_setting,company_location,company_size
0,2023,Data DevOps Engineer,Data Engineering,EUR,88000,95012,Germany,Mid-level,Full-time,Hybrid,Germany,L
1,2023,Data Architect,Data Architecture and Modeling,USD,186000,186000,United States,Senior,Full-time,In-person,United States,M
2,2023,Data Architect,Data Architecture and Modeling,USD,81800,81800,United States,Senior,Full-time,In-person,United States,M
3,2023,Data Scientist,Data Science and Research,USD,212000,212000,United States,Senior,Full-time,In-person,United States,M
4,2023,Data Scientist,Data Science and Research,USD,93300,93300,United States,Senior,Full-time,In-person,United States,M
...,...,...,...,...,...,...,...,...,...,...,...,...
9350,2021,Data Specialist,Data Management and Strategy,USD,165000,165000,United States,Senior,Full-time,Remote,United States,L
9351,2020,Data Scientist,Data Science and Research,USD,412000,412000,United States,Senior,Full-time,Remote,United States,L
9352,2021,Principal Data Scientist,Data Science and Research,USD,151000,151000,United States,Mid-level,Full-time,Remote,United States,L
9353,2020,Data Scientist,Data Science and Research,USD,105000,105000,United States,Entry-level,Full-time,Remote,United States,S
9354,2020,Business Data Analyst,Data Analysis,USD,100000,100000,United States,Entry-level,Contract,Remote,United States,L

In [12]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3755 entries, 0 to 3754
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   work_year           3755 non-null   int64
 1   experience_level    3755 non-null   object
 2   employment_type     3755 non-null   object
 3   job_title           3755 non-null   object
 4   salary              3755 non-null   int64
 5   salary_currency     3755 non-null   object
 6   salary_in_usd       3755 non-null   int64
 7   employee_residence  3755 non-null   object
 8   remote_ratio        3755 non-null   int64
 9   company_location    3755 non-null   object
 10  company_size        3755 non-null   object
dtypes: int64(4), object(7)
memory usage: 322.8+ KB

In [13]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5341 entries, 0 to 9354
Data columns (total 12 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   work_year           5341 non-null   int64
 1   job_title           5341 non-null   object
 2   job_category        5341 non-null   object
 3   salary_currency     5341 non-null   object
 4   salary              5341 non-null   int64
 5   salary_in_usd       5341 non-null   int64
 6   employee_residence  5341 non-null   object
 7   experience_level    5341 non-null   object
 8   employment_type     5341 non-null   object
 9   work_setting        5341 non-null   object
 10  company_location    5341 non-null   object
 11  company_size        5341 non-null   object
dtypes: int64(3), object(9)
memory usage: 542.4+ KB

In [14]:
df1["remote_ratio"] = df1["remote_ratio"].astype(str)

In [15]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3755 entries, 0 to 3754
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   work_year           3755 non-null   int64
 1   experience_level    3755 non-null   object
 2   employment_type     3755 non-null   object
 3   job_title           3755 non-null   object
 4   salary              3755 non-null   int64
 5   salary_currency     3755 non-null   object
 6   salary_in_usd       3755 non-null   int64
 7   employee_residence  3755 non-null   object
 8   remote_ratio        3755 non-null   object
 9   company_location    3755 non-null   object
 10  company_size        3755 non-null   object
dtypes: int64(3), object(8)
memory usage: 322.8+ KB

In [16]:
df1.rename(columns={"remote_ratio": "work_setting"}, inplace=True)

In [17]:
df1

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,work_setting,company_location,company_size
0,2023,SE,FT,Principal Data Scientist,80000,EUR,85847,ES,100,ES,L
1,2023,MI,CT,ML Engineer,30000,USD,30000,US,100,US,S
2,2023,MI,CT,ML Engineer,25500,USD,25500,US,100,US,S
3,2023,SE,FT,Data Scientist,175000,USD,175000,CA,100,CA,M
4,2023,SE,FT,Data Scientist,120000,USD,120000,CA,100,CA,M
...,...,...,...,...,...,...,...,...,...,...,...
3750,2020,SE,FT,Data Scientist,412000,USD,412000,US,100,US,L
3751,2021,MI,FT,Principal Data Scientist,151000,USD,151000,US,100,US,L
3752,2020,EN,FT,Data Scientist,105000,USD,105000,US,100,US,S
3753,2020,EN,CT,Business Data Analyst,100000,USD,100000,US,100,US,L
3754,2021,SE,FT,Data Science Manager,7000000,INR,94665,IN,50,IN,L

In [18]:
replace_dict = {"100": "Remote", "50": "Hybrid", "0": "In-person"}
df1["work_setting"] = df1["work_setting"].map(replace_dict)

In [19]:
df1

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,work_setting,company_location,company_size
0,2023,SE,FT,Principal Data Scientist,80000,EUR,85847,ES,Remote,ES,L
1,2023,MI,CT,ML Engineer,30000,USD,30000,US,Remote,US,S
2,2023,MI,CT,ML Engineer,25500,USD,25500,US,Remote,US,S
3,2023,SE,FT,Data Scientist,175000,USD,175000,CA,Remote,CA,M
4,2023,SE,FT,Data Scientist,120000,USD,120000,CA,Remote,CA,M
...,...,...,...,...,...,...,...,...,...,...,...
3750,2020,SE,FT,Data Scientist,412000,USD,412000,US,Remote,US,L
3751,2021,MI,FT,Principal Data Scientist,151000,USD,151000,US,Remote,US,L
3752,2020,EN,FT,Data Scientist,105000,USD,105000,US,Remote,US,S
3753,2020,EN,CT,Business Data Analyst,100000,USD,100000,US,Remote,US,L
3754,2021,SE,FT,Data Science Manager,7000000,INR,94665,IN,Hybrid,IN,L

In [20]:
replace_dict = {"SE": "Senior", "MI": "Mid-level", "EN": "Entry-level", "EX": "Executive"}
df1["experience_level"] = df1["experience_level"].map(replace_dict)

In [21]:
df1

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,work_setting,company_location,company_size
0,2023,Senior,FT,Principal Data Scientist,80000,EUR,85847,ES,Remote,ES,L
1,2023,Mid-level,CT,ML Engineer,30000,USD,30000,US,Remote,US,S
2,2023,Mid-level,CT,ML Engineer,25500,USD,25500,US,Remote,US,S
3,2023,Senior,FT,Data Scientist,175000,USD,175000,CA,Remote,CA,M
4,2023,Senior,FT,Data Scientist,120000,USD,120000,CA,Remote,CA,M
...,...,...,...,...,...,...,...,...,...,...,...
3750,2020,Senior,FT,Data Scientist,412000,USD,412000,US,Remote,US,L
3751,2021,Mid-level,FT,Principal Data Scientist,151000,USD,151000,US,Remote,US,L
3752,2020,Entry-level,FT,Data Scientist,105000,USD,105000,US,Remote,US,S
3753,2020,Entry-level,CT,Business Data Analyst,100000,USD,100000,US,Remote,US,L
3754,2021,Senior,FT,Data Science Manager,7000000,INR,94665,IN,Hybrid,IN,L

In [22]:
replace_dict = {"FT": "Full-time", "CT": "Contract", "FL": "Freelance", "PT": "Part-time"}
df1["employment_type"] = df1["employment_type"].map(replace_dict)

In [23]:
df1

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,work_setting,company_location,company_size
0,2023,Senior,Full-time,Principal Data Scientist,80000,EUR,85847,ES,Remote,ES,L
1,2023,Mid-level,Contract,ML Engineer,30000,USD,30000,US,Remote,US,S
2,2023,Mid-level,Contract,ML Engineer,25500,USD,25500,US,Remote,US,S
3,2023,Senior,Full-time,Data Scientist,175000,USD,175000,CA,Remote,CA,M
4,2023,Senior,Full-time,Data Scientist,120000,USD,120000,CA,Remote,CA,M
...,...,...,...,...,...,...,...,...,...,...,...
3750,2020,Senior,Full-time,Data Scientist,412000,USD,412000,US,Remote,US,L
3751,2021,Mid-level,Full-time,Principal Data Scientist,151000,USD,151000,US,Remote,US,L
3752,2020,Entry-level,Full-time,Data Scientist,105000,USD,105000,US,Remote,US,S
3753,2020,Entry-level,Contract,Business Data Analyst,100000,USD,100000,US,Remote,US,L
3754,2021,Senior,Full-time,Data Science Manager,7000000,INR,94665,IN,Hybrid,IN,L

In [24]:
df1.employee_residence.unique()

array(['ES', 'US', 'CA', 'DE', 'GB', 'NG', 'IN', 'HK', 'PT', 'NL', 'CH',
       'CF', 'FR', 'AU', 'FI', 'UA', 'IE', 'IL', 'GH', 'AT', 'CO', 'SG',
       'SE', 'SI', 'MX', 'UZ', 'BR', 'TH', 'HR', 'PL', 'KW', 'VN', 'CY',
       'AR', 'AM', 'BA', 'KE', 'GR', 'MK', 'LV', 'RO', 'PK', 'IT', 'MA',
       'LT', 'BE', 'AS', 'IR', 'HU', 'SK', 'CN', 'CZ', 'CR', 'TR', 'CL',
       'PR', 'DK', 'BO', 'PH', 'DO', 'EG', 'ID', 'AE', 'MY', 'JP', 'EE',
       'HN', 'TN', 'RU', 'DZ', 'IQ', 'BG', 'JE', 'RS', 'NZ', 'MD', 'LU',
       'MT'], dtype=object)

In [25]:
df3 = pd.read_excel("ds_salaries.xlsx", index_col=0)
#df3.drop_duplicates(inplace=True)
df3.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3755 entries, 2023 to 2021
Data columns (total 10 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   experience_level    3755 non-null   object
 1   employment_type     3755 non-null   object
 2   job_title           3755 non-null   object
 3   salary              3755 non-null   int64
 4   salary_currency     3755 non-null   object
 5   salary_in_usd       3755 non-null   int64
 6   employee_residence  3755 non-null   object
 7   remote_ratio        3755 non-null   int64
 8   company_location    3753 non-null   object
 9   company_size        3755 non-null   object
dtypes: int64(3), object(7)
memory usage: 322.7+ KB

In [26]:
#df3.employee_residence.unique()

In [27]:
df1['employee_residence'] = df3['employee_residence'].values
df1['company_location'] = df3['company_location'].values
df1

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,work_setting,company_location,company_size
0,2023,Senior,Full-time,Principal Data Scientist,80000,EUR,85847,Spain,Remote,Spain,L
1,2023,Mid-level,Contract,ML Engineer,30000,USD,30000,United States,Remote,United States,S
2,2023,Mid-level,Contract,ML Engineer,25500,USD,25500,United States,Remote,United States,S
3,2023,Senior,Full-time,Data Scientist,175000,USD,175000,Canada,Remote,Canada,M
4,2023,Senior,Full-time,Data Scientist,120000,USD,120000,Canada,Remote,Canada,M
...,...,...,...,...,...,...,...,...,...,...,...
3750,2020,Senior,Full-time,Data Scientist,412000,USD,412000,United States,Remote,United States,L
3751,2021,Mid-level,Full-time,Principal Data Scientist,151000,USD,151000,United States,Remote,United States,L
3752,2020,Entry-level,Full-time,Data Scientist,105000,USD,105000,United States,Remote,United States,S
3753,2020,Entry-level,Contract,Business Data Analyst,100000,USD,100000,United States,Remote,United States,L
3754,2021,Senior,Full-time,Data Science Manager,7000000,INR,94665,India,Hybrid,India,L

In [28]:
df1.drop_duplicates(inplace=True)
df1

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,work_setting,company_location,company_size
0,2023,Senior,Full-time,Principal Data Scientist,80000,EUR,85847,Spain,Remote,Spain,L
1,2023,Mid-level,Contract,ML Engineer,30000,USD,30000,United States,Remote,United States,S
2,2023,Mid-level,Contract,ML Engineer,25500,USD,25500,United States,Remote,United States,S
3,2023,Senior,Full-time,Data Scientist,175000,USD,175000,Canada,Remote,Canada,M
4,2023,Senior,Full-time,Data Scientist,120000,USD,120000,Canada,Remote,Canada,M
...,...,...,...,...,...,...,...,...,...,...,...
3750,2020,Senior,Full-time,Data Scientist,412000,USD,412000,United States,Remote,United States,L
3751,2021,Mid-level,Full-time,Principal Data Scientist,151000,USD,151000,United States,Remote,United States,L
3752,2020,Entry-level,Full-time,Data Scientist,105000,USD,105000,United States,Remote,United States,S
3753,2020,Entry-level,Contract,Business Data Analyst,100000,USD,100000,United States,Remote,United States,L
3754,2021,Senior,Full-time,Data Science Manager,7000000,INR,94665,India,Hybrid,India,L

In [29]:
df2

,work_year,job_title,job_category,salary_currency,salary,salary_in_usd,employee_residence,experience_level,employment_type,work_setting,company_location,company_size
0,2023,Data DevOps Engineer,Data Engineering,EUR,88000,95012,Germany,Mid-level,Full-time,Hybrid,Germany,L
1,2023,Data Architect,Data Architecture and Modeling,USD,186000,186000,United States,Senior,Full-time,In-person,United States,M
2,2023,Data Architect,Data Architecture and Modeling,USD,81800,81800,United States,Senior,Full-time,In-person,United States,M
3,2023,Data Scientist,Data Science and Research,USD,212000,212000,United States,Senior,Full-time,In-person,United States,M
4,2023,Data Scientist,Data Science and Research,USD,93300,93300,United States,Senior,Full-time,In-person,United States,M
...,...,...,...,...,...,...,...,...,...,...,...,...
9350,2021,Data Specialist,Data Management and Strategy,USD,165000,165000,United States,Senior,Full-time,Remote,United States,L
9351,2020,Data Scientist,Data Science and Research,USD,412000,412000,United States,Senior,Full-time,Remote,United States,L
9352,2021,Principal Data Scientist,Data Science and Research,USD,151000,151000,United States,Mid-level,Full-time,Remote,United States,L
9353,2020,Data Scientist,Data Science and Research,USD,105000,105000,United States,Entry-level,Full-time,Remote,United States,S
9354,2020,Business Data Analyst,Data Analysis,USD,100000,100000,United States,Entry-level,Contract,Remote,United States,L

In [30]:
df2.drop(columns=["job_category"], inplace=True)
df2

,work_year,job_title,salary_currency,salary,salary_in_usd,employee_residence,experience_level,employment_type,work_setting,company_location,company_size
0,2023,Data DevOps Engineer,EUR,88000,95012,Germany,Mid-level,Full-time,Hybrid,Germany,L
1,2023,Data Architect,USD,186000,186000,United States,Senior,Full-time,In-person,United States,M
2,2023,Data Architect,USD,81800,81800,United States,Senior,Full-time,In-person,United States,M
3,2023,Data Scientist,USD,212000,212000,United States,Senior,Full-time,In-person,United States,M
4,2023,Data Scientist,USD,93300,93300,United States,Senior,Full-time,In-person,United States,M
...,...,...,...,...,...,...,...,...,...,...,...
9350,2021,Data Specialist,USD,165000,165000,United States,Senior,Full-time,Remote,United States,L
9351,2020,Data Scientist,USD,412000,412000,United States,Senior,Full-time,Remote,United States,L
9352,2021,Principal Data Scientist,USD,151000,151000,United States,Mid-level,Full-time,Remote,United States,L
9353,2020,Data Scientist,USD,105000,105000,United States,Entry-level,Full-time,Remote,United States,S
9354,2020,Business Data Analyst,USD,100000,100000,United States,Entry-level,Contract,Remote,United States,L

In [31]:
frames = [df1, df2]

mini_project_dataset = pd.concat(frames)
mini_project_dataset

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,work_setting,company_location,company_size
0,2023,Senior,Full-time,Principal Data Scientist,80000,EUR,85847,Spain,Remote,Spain,L
1,2023,Mid-level,Contract,ML Engineer,30000,USD,30000,United States,Remote,United States,S
2,2023,Mid-level,Contract,ML Engineer,25500,USD,25500,United States,Remote,United States,S
3,2023,Senior,Full-time,Data Scientist,175000,USD,175000,Canada,Remote,Canada,M
4,2023,Senior,Full-time,Data Scientist,120000,USD,120000,Canada,Remote,Canada,M
...,...,...,...,...,...,...,...,...,...,...,...
9350,2021,Senior,Full-time,Data Specialist,165000,USD,165000,United States,Remote,United States,L
9351,2020,Senior,Full-time,Data Scientist,412000,USD,412000,United States,Remote,United States,L
9352,2021,Mid-level,Full-time,Principal Data Scientist,151000,USD,151000,United States,Remote,United States,L
9353,2020,Entry-level,Full-time,Data Scientist,105000,USD,105000,United States,Remote,United States,S
9354,2020,Entry-level,Contract,Business Data Analyst,100000,USD,100000,United States,Remote,United States,L

In [32]:
mini_project_dataset.drop_duplicates(inplace=True)
mini_project_dataset

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,work_setting,company_location,company_size
0,2023,Senior,Full-time,Principal Data Scientist,80000,EUR,85847,Spain,Remote,Spain,L
1,2023,Mid-level,Contract,ML Engineer,30000,USD,30000,United States,Remote,United States,S
2,2023,Mid-level,Contract,ML Engineer,25500,USD,25500,United States,Remote,United States,S
3,2023,Senior,Full-time,Data Scientist,175000,USD,175000,Canada,Remote,Canada,M
4,2023,Senior,Full-time,Data Scientist,120000,USD,120000,Canada,Remote,Canada,M
...,...,...,...,...,...,...,...,...,...,...,...
8586,2022,Mid-level,Full-time,Applied Machine Learning Scientist,75000,USD,75000,Bolivia,Remote,United States,M
9068,2022,Mid-level,Full-time,Applied Machine Learning Scientist,75000,USD,75000,Bolivia,Remote,United States,L
9123,2021,Mid-level,Full-time,Applied Machine Learning Scientist,38400,USD,38400,Vietnam,Remote,United States,M
9276,2021,Senior,Full-time,Data Analytics Engineer,50000,USD,50000,Vietnam,Remote,United Kingdom,M
9324,2021,Mid-level,Full-time,Big Data Engineer,18000,USD,18000,Moldova,In-person,Moldova,S

In [33]:
mini_project_dataset.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5563 entries, 0 to 9324
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   work_year           5563 non-null   int64
 1   experience_level    5563 non-null   object
 2   employment_type     5563 non-null   object
 3   job_title           5563 non-null   object
 4   salary              5563 non-null   int64
 5   salary_currency     5563 non-null   object
 6   salary_in_usd       5563 non-null   int64
 7   employee_residence  5563 non-null   object
 8   work_setting        5563 non-null   object
 9   company_location    5561 non-null   object
 10  company_size        5563 non-null   object
dtypes: int64(3), object(8)
memory usage: 521.5+ KB

In [34]:
mini_project_dataset.isnull().sum()

work_year             0
experience_level      0
employment_type       0
job_title             0
salary                0
salary_currency       0
salary_in_usd         0
employee_residence    0
work_setting          0
company_location      2
company_size          0
dtype: int64

In [35]:
mini_project_dataset.dropna(inplace=True)
mini_project_dataset

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,work_setting,company_location,company_size
0,2023,Senior,Full-time,Principal Data Scientist,80000,EUR,85847,Spain,Remote,Spain,L
1,2023,Mid-level,Contract,ML Engineer,30000,USD,30000,United States,Remote,United States,S
2,2023,Mid-level,Contract,ML Engineer,25500,USD,25500,United States,Remote,United States,S
3,2023,Senior,Full-time,Data Scientist,175000,USD,175000,Canada,Remote,Canada,M
4,2023,Senior,Full-time,Data Scientist,120000,USD,120000,Canada,Remote,Canada,M
...,...,...,...,...,...,...,...,...,...,...,...
8586,2022,Mid-level,Full-time,Applied Machine Learning Scientist,75000,USD,75000,Bolivia,Remote,United States,M
9068,2022,Mid-level,Full-time,Applied Machine Learning Scientist,75000,USD,75000,Bolivia,Remote,United States,L
9123,2021,Mid-level,Full-time,Applied Machine Learning Scientist,38400,USD,38400,Vietnam,Remote,United States,M
9276,2021,Senior,Full-time,Data Analytics Engineer,50000,USD,50000,Vietnam,Remote,United Kingdom,M
9324,2021,Mid-level,Full-time,Big Data Engineer,18000,USD,18000,Moldova,In-person,Moldova,S

In [37]:
mini_project_dataset.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5561 entries, 0 to 9324
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   work_year           5561 non-null   int64
 1   experience_level    5561 non-null   object
 2   employment_type     5561 non-null   object
 3   job_title           5561 non-null   object
 4   salary              5561 non-null   int64
 5   salary_currency     5561 non-null   object
 6   salary_in_usd       5561 non-null   int64
 7   employee_residence  5561 non-null   object
 8   work_setting        5561 non-null   object
 9   company_location    5561 non-null   object
 10  company_size        5561 non-null   object
dtypes: int64(3), object(8)
memory usage: 521.3+ KB